Gravel Case/0/sed
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      sed;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar>
1455419
(
0.7
0.7
0.7
0.7
0.7
0.7
0.7
0.7
...
)
;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    slope
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value      uniform 0;
    }
    frontandback1
    {
        type            empty;
    }
    frontandback2
    {
        type            empty;
    }
    topLeft //inlet
    {
        type            zeroGradient;
    }
    botLeft //bottom
    {
        type            zeroGradient;
    }
    botRight //outlet
    {
        type            zeroGradient;
    }
    topRight //atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value      uniform 0;
    }
}


// ************************************************************************* //