Gravel Case/constant/DragProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      DragProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

GidaspowErgunWenyu on;

GidaspowSchillerNaumann off;

Gibilaro off;

GidaspowErgunWenyuCoeffs
{
      alphaG              400;
      betaG               20;
}

GeneralCoeffs
{
      gammaCoeff          0;
}

// ************************************************************************* //
